Enums/СпособыРасчетаОплатыТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СпособыРасчетаОплатыТруда</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоначислениеПоУправленческомуУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаДоРазмераМЗПотМесячнойМЗП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаДоРазмераМинимальнойЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаЗаВечерниеЧасы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаЗаНочныеЧасы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаЗаЗаместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочтовыйСбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаЗаСовмещениеПоОкладу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаЗаСовмещениеПоТарифу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаОтСтавкиПервогоРазряда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаОтСтавкиПервогоСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныйЛистПроцентом</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныйЛистПроцентомДоПредела</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныйЛистФиксСуммойДоПредела</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныйЛистПроцентомДоПределаСНДФЛ</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныйЛистПроцентомСНДФЛ</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НулеваяСумма</Name>
					<Comment>(Общ) ВР без расчета результата</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомиссионыйСбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтСтажаПоДневнойТарифнойСтавке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтСтажаПоМесячнойТарифнойСтавкеПоДням</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтСтажаПоМесячнойТарифнойСтавкеПоЧасам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтСтажаПоЧасовойТарифнойСтавке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтСтажаПроцентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруФиксированнойСуммой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДневнойТарифнойСтавке</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоМесячнойТарифнойСтавкеПоДням</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоМесячнойТарифнойСтавкеПоЧасам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЧасовойТарифнойСтавке</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаРебенкаСтарше3Лет</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаРебенкаДо3ЛетНаВторого</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаРебенкаДо3ЛетНаРебенкаИнвалида</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаРебенкаДо3Лет</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаРебенкаСтарше3ЛетНаРебенкаИнвалида</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаРебенкаВИЧ</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаРебенкаИнвалида</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеМатериОдиночкеДо3Лет</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаРебенкаДо18ЛетНадб40</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаРебенкаСНадбавкой40До3Лет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНеРабМатериНадб40До3Лет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНеРабМатериОдиночкеДо1_5Лет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеМатериОдиночкеДо1_5лет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНеРабМатериОдиночкеДо3Лет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНеРаботающейМатериДо3Лет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаДоСреднегоЗаработка</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСреднемуЗаработку</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСреднемуЗаработкуДляОтпускаПоШестидневке</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСреднемуЗаработкуОтпускаПоБеременности</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоБеременностиОтБПМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСреднемуЗаработкуФСС</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдельныйЗаработок</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СевернаяНадбавка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаПоЧасовойТарифнойСтавке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдержаниеФиксированнойСуммой</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдельныйПриработок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПоЧасовойТарифнойСтавкеДляПочасовогоОтклонения</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПоСреднемуЗаработкуДляПочасовогоОтклонения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьФиксированнойСуммойДляПочасовогоОтклонения</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПоМесячнойТарифнойСтавкеПоЧасамДляПочасовогоОтклонения</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМаксП1УП2_П3УП4ДП5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1ДП2ОП3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1ДП2УП3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1ОП2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1ОП2ДП3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1ОП2УП3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1УП2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1УП2ДП3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1УП2ОП3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1УП2УП3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП3ДП1ОП2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьП1УП2УП3ДП4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМаксП1_П2УП3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМинП1_П2УП3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМаксП1_П2УП3ОП4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМинП1_П2УП3ОП4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМаксП1УП2_П5ДП3УП4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМаксП1УП2ДП3ВП4_0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМаксП1ВП2_0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдельныйПриработокМесячнаяСтавкаЧасы</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСреднемуЗаработкуИзФМП</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентомПоЧасовойТарифнойСтавке</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМаксП1_П2УП3УП4ДП5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированнойСуммой</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольнаяФормула</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныйЛистВПрожиточныхМинимумах</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксСуммойПропорционльноОтработанномуВремени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксСуммойПропорционльноОтработанномуВремениПоЧасам</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Индексация</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСреднемуЗаработкуФСЗН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КТУ</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетБЛотТарифнойСтавки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЧасовойТарифнойСтавкеВодителей</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЧасовойТарифнойСтавкеВодителейРемонт</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентомПоЧасовойТарифнойСтавкеВодители</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентомПоЧасовойТарифнойСтавкеРемонт</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРазницеМеждуЧасовымиСтавками</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжемесячнаяПремия</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаПоЧасовойТарифнойСтавкеВодителей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдельныйПриработокВодителей</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЧасовойТарифнойСтавкеВодителейРемонтПлановый</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентомПоЧасовойТарифнойСтавкеРемонтПлановый</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентомСоСнижением</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаРебенкаДо3Лет50ПроцентовБПМ</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаОтСтавкиПервогоРазрядаПропорциональноОтработанномуВремени</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтСтажаКоличествомБазовых</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентомОтСдельногоЗаработкаВодителей</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЧасовойТарифнойСтавкеВодителейБезВыезда</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентомСКТУ</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаРебенкаИнвалидаДо3Лет100ПроцентовБПМ</Name>
					<Comment>По уходу за ребенком-инвалидом в возрасте до 18 лет (ежемесячное) с III и IV степенью утраты здоровья до исполнения ребенку 3 лет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаРебенкаИнвалидаПосле3Лет120ПроцентовБПМ</Name>
					<Comment>По уходу за ребенком-инвалидом в возрасте до 18 лет (ежемесячное) с III и IV степенью утраты здоровья после исполнения ребенку 3 лет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентомПоИнойЧасовойТарифнойСтавке</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентомПоИнойМесячнойТарифнойСтавке</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентомПоВычисляемойЧасовойТарифнойСтавке</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтСтажаФиксированнойСуммой</Name>
					<Comment>vvv</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ВнешниеФункцииСКД/Ext/Module.bsl
Функция СтажСтрокой(Лет,Месяцев) Экспорт
	
	Возврат ?(Лет=0,"",Строка(Лет)+?((Число(Прав(Лет,1))<5) и ((Лет<>11)и(Лет<>12)и(Лет<>13)и(Лет<>14)),"г ","л "))+?(Месяцев=0,"",Строка(Месяцев)+"м");
	
КонецФункции

Функция ПоказательВидаРасчета(ВидРасчета,ОплаченоДнейЧасов,Показатель1,Показатель2,Показатель3,СуммаРезерва,ППС) Экспорт
		
	СтрокаДоп="";
	Если ТипЗнч(ВидРасчета)=Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций") ТОгда
		Если ВидРасчета.ПроизвольнаяФормулаРасчета ТОгда
			Если (ВидРасчета.Показатели.Количество()>0) и (Показатель1<>0) Тогда
				Стр=ВидРасчета.Показатели[0];
				СтрокаДоп=Строка(Показатель1)+(Стр.Показатель.НаименованиеДляПечати);
			КонецЕсли;		
			Если (ВидРасчета.Показатели.Количество()>1) и (Показатель2<>0) Тогда
				Стр=ВидРасчета.Показатели[1];
				СтрокаДоп=СтрокаДоп+" "+Строка(Показатель2)+(Стр.Показатель.НаименованиеДляПечати);
			КонецЕсли;		
		ИначеЕсли ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.ЕжемесячнаяПремия ТОгда
			Если Показатель2<>0 Тогда
				СтрокаДоп=Строка(Показатель2)+"% снижено от "+Строка(Показатель1)+"%";
			Иначе
				СтрокаДоп=Строка(Показатель1)+"%";
			КонецЕсли;			
		ИначеЕсли ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.ПроцентомПоЧасовойТарифнойСтавкеВодители
			или ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.ПроцентомПоЧасовойТарифнойСтавкеРемонт
			или ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.ПроцентомПоЧасовойТарифнойСтавкеРемонтПлановый ТОгда
			Если Показатель3<>0 Тогда
				СтрокаДоп=Строка(Показатель3)+"% снижено от "+Строка(Показатель2)+"%";
			Иначе
				СтрокаДоп=Строка(Показатель2)+"%";
			КонецЕсли;	
		ИначеЕсли (ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.ДоплатаОтСтавкиПервогоРазряда) Тогда
			СтрокаДоп=Строка(Показатель1)+"% "+Строка(ОплаченоДнейЧасов)+"ч.";
		ИначеЕсли (ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.ПоМесячнойТарифнойСтавкеПоЧасам) или (ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавке) 
			или (ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаНочныеЧасы) или (ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.ДоплатаЗаЗаместительство) или (ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку)
			или (ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавкеВодителей) или (ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавкеВодителейБезВыезда) или (ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.СделкаПоЧасовойТарифнойСтавкеВодителей) или (ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.СделкаПоЧасовойТарифнойСтавке) 
			или (ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавкеВодителейРемонт) или (ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.ПоЧасовойТарифнойСтавкеВодителейРемонтПлановый) ТОгда
			СтрокаДоп=Строка(ОплаченоДнейЧасов)+"ч.";
		ИначеЕсли ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСЗН ТОгда	
			СтрокаДоп=Строка(ОплаченоДнейЧасов)+"д. "+Строка(Показатель1)+"%";
		ИначеЕсли ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням ТОгда	
			СтрокаДоп=Строка(ОплаченоДнейЧасов)+"д.";	
		ИначеЕсли (ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.Процентом) или (ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.Индексация) или (ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.ОтСтажаПроцентом) ТОгда	
			СтрокаДоп=Строка(Показатель1)+"%";	
		ИначеЕсли ВидРасчета.СпособРасчета=Перечисления.СпособыРасчетаОплатыТруда.ОтСтажаПоЧасовойТарифнойСтавке ТОгда	
			СтрокаДоп=Строка(Показатель2)+"%";		
		КонецЕсли;
		Если СуммаРезерва<>0 ТОгда
			СтрокаДоп=СтрокаДоп+" (резерв "+Строка(СуммаРезерва)+ " руб.)"
		КонецЕсли;		
	ИначеЕсли ТипЗнч(ВидРасчета)=Тип("ПланВидовРасчетаСсылка.УдержанияОрганизаций") ТОгда
		Если ОплаченоДнейЧасов<>0 ТОгда
			СтрокаДоп="(№ "+Формат(ОплаченоДнейЧасов,"ЧЦ=12; ЧГ=0")+")";
		КонецЕсли;		
	КонецЕсли;
	
	Если ППС Тогда
		СтрокаДоп=СтрокаДоп+", ППС";
	КонецЕсли;			
	
	Возврат СтрокаДоп;
	
КонецФункции

Функция ЛетКонтрактаПрописью(Год) Экспорт
	
	Если (Год=0) или (Год=NULL) ТОгда Возврат ""; КонецЕсли;
	
	Если Число(Прав(Год,1))<5 и (Год<>11)и(Год<>12)и(Год<>13)и(Год<>14) ТОгда
		Возврат Строка(Год)+?(Год=1," год"," года");		
	КонецЕсли;
	
	Возврат Строка(Год)+" лет";
	
КонецФункции

Функция ОстатокКонтрактаПрописью(ДатаНачала,ДатаОкончания,Период) Экспорт
	
	Если (ДатаНачала=NULL) или (ДатаОкончания=NULL) ТОгда
		Возврат "";
	КонецЕсли;
	
	КолМес=12*Год(ДатаОкончания)+Месяц(ДатаОкончания)-1;
	
	ОстВМес=КолМес - (12*Год(Период)+Месяц(Период)-1);
	Если ДатаОкончания > Период тогда
		Если День(ДатаОкончания)<День(Период) тогда
			ОстВмес=ОстВмес-1;
			ОстДней=День(КонецМесяца(ДобавитьМесяц(ДатаОкончания,-1))) - День(Период)+День(ДатаОкончания);
		иначе
			ОстДней=День(ДатаОкончания) - День(Период);
		КонецЕсли;
		ОстВгодах=Цел(ОстВМес/12);
		
		Остаток=?(ОстВгодах=0,"",Строка(ОстВгодах)+"г ")+
		 ?(ОстВмес-ОстВгодах*12=0,"",Строка(ОстВмес-ОстВгодах*12)+"м ")+
         ?(ОстДней=0,"",Строка(ОстДней)+"дн ");
	иначе
		Остаток="Истек";	
	КонецЕсли;
	
	Возврат Остаток;
	
КонецФункции

Функция СокрЛП_СКД(Параметр) Экспорт
	Возврат СокрЛП(Параметр);
КонецФункции

Функция Число_СКД(Параметр) Экспорт
	Возврат Число(Параметр);
КонецФункции

Функция Символы_ПС() Экспорт
	Возврат Символы.ПС;
КонецФункции

Функция ФИО(Сотрудник) Экспорт
	
	Возврат ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(Сотрудник.ФизЛицо);
	
КонецФункции

Функция СКД_ПолноеНаименованиеВидаРаботы(ВидРаботы) Экспорт
	
	Возврат  СокрЛП(ВидРаботы.КодПоПрейскуранту)+" "+СтрЗаменить(ВидРаботы.ПолноеНаименование(),"ПРЕЙСКУРАНТЫ ОБЛГАЗА/","");
	
КонецФункции
